import React from 'react';
import { Typography } from '@mui/material';

const About = () => (
  <div style={{ padding: '16px' }}>
    <Typography variant="h2" align="center" gutterBottom>
      אודותיי
    </Typography>
    <Typography variant="body1" align="right" paragraph>
      שלום, אני רויטל מתוקו, ואני מתמחה בליווי והכוונה של נערים ונערות לתפקידים בצבא ובהשגת מידע ותפקידים ראשונים בתעשיית ההייטק. אני בעלת תואר ראשון בפסיכולוגיה מאוניברסיטת רייכמן, עם התמחות בפסיכולוגיה ארגונית. לאורך הקריירה שלי צברתי ניסיון עשיר בעבודה עם בני נוער ובניהול תהליכי גיוס בחברות הייטק מובילות.
      <br /><br />
      אני מייסדת המיזם TECH IT, המיועד להעניק תמיכה והכוונה לנערים ונערות המעוניינים להשתלב בתפקידים טכנולוגיים בצבא ולאחר מכן בתעשיית ההייטק. במסגרת המיזם, אני מלווה את הנערים בתהליך ההכנה לצבא, מספקת מידע וכלים מעשיים להצלחה במיונים ומשמשת כמדריכה ביחידת מגשימים.
      <br /><br />
      במהלך התמחותי במשאבי אנוש בחברת Overwolf, השתתפתי בתהליכי גיוס, כולל סינון קורות חיים ותיאום ראיונות עבודה. בנוסף, כיהנתי כראש יחידת הטכנולוגיה של אגודת הסטודנטים באוניברסיטת רייכמן, שם ניהלתי אתר אינטרנט, יצרתי ניוזלטרים דיגיטליים והובלתי צוות של מתנדבים.
      <br /><br />
      השירות הצבאי שלי כלל תפקיד של קצינת אבטחת מידע בחיל המודיעין, שם קיבלתי פרס הצטיינות על תפקודי. במהלך השירות, הדרכתי חיילים וקצינים, ניהלתי מסמכים ותהליכים והקפדתי על עמידה בסטנדרטים גבוהים של אבטחה.
      <br /><br />
      אני כאן כדי לעזור לכם להגיע להצלחה ולהגשים את השאיפות שלכם. יחד נוכל לבנות את העתיד שלכם בתעשיית ההייטק ובשירות הצבאי. אל תהססו ליצור קשר ואני אשמח לעזור בכל דרך אפשרית.
    </Typography>
  </div>
);

export default About;
